{
  "texts": {
    "mainTitle": "PRIVACY EN SECURITY ALS STANDAARD",
    "mainSubtitle": "Hoe Notive veilig en consistent met gevoelige gegevens om kan gaan",
    "headerDetails": "Thijs Kraaijenbos",
    "date": "20-01-2026",
    "probleemEnContext": {
      "title": "Probleem & Context",
      "context": {
        "title": "Context",
        "description1": "Het is geen nieuw feit dat het in de huidige tijd cruciaal is om ervoor te zorgen dat er op een verantwoorde en veilige manier wordt omgegaan met persoonsgegevens. Deze gegevens zijn namelijk erg gevoelig, waardoor het veel nadelige effecten kan hebben als deze gegevens worden gelekt of in verkeerde handen terechtkomen.",
        "description2": "Het doel van dit onderzoek is om uit te zoeken op welke manieren Notive consistent aan de AVG (Algemene Verordening Gegevensbescherming) regelgeving kan voldoen.",
        "description3": "Om de context beter in kaart te brengen maak ik gebruik van een SWOT-analyse, confrontatiematrix, en een impactladder."
      },
      "onderzoeksvraag": {
        "title": "Onderzoeks­vraag",
        "description1": "Voor dit onderzoek is er als eerst een duidelijke onderzoeksvraag vastgesteld op basis van de context van het probleem. Deze vraag richt zich op het zoeken van verschillende manieren om Notive te ondersteunen bij het doel. De onderzoeksvraag is als volgt:",
        "description2": "'Welke processen, tools en beleidsmaatregelen moet Notive implementeren om consistent gevoelige gegevens conform de AVG te verwerken?'"
      },
      "standpunt": {
        "title": "Standpunt",
        "description1": "Verder wordt er in dit onderzoek uiteindelijk een mening verdedigt door middel van argumenten die zijn vastgesteld op basis van het onderzoek. Het standpunt dat verdedigd wordt is als volgt:",
        "description2": "Notive moet een duidelijk en transparant privacy- en securitybeleid opstellen en hier in combinatie met externe tools gebruik van maken om consistent gegevens conform de AVG te verwerken."
      }
    },
    "swot": {
      "title": "SWOT-analyse",
      "description": "De eerste tool die ik heb toegepast is de SWOT analyse. Deze heb ik gebruikt om een duidelijk beeld te vormen van de interne en externe factoren die te maken hebben met het onderwerp en de onderzoeksvraag. Bij een SWOT-analyse zijn de sterktes en zwaktes de interne factoren waar het bedrijf invloed op kan hebben. De kansen en bedreigingen zijn externe factoren waar het bedrijf geen invloed op heeft, maar waar het bedrijf wel rekening mee moet houden.",
      "sterktes": {
        "title": "Sterktes",
        "1": "Diverse kennisvlakken binnen het team. (technische kennis, sales/marketing, UX design, etc.)",
        "2": "Klantgerichte aanpak & houding",
        "3": "Positief imago bij klanten."
      },
      "zwaktes": {
        "title": "Zwaktes",
        "1": "Er is geen duidelijk beleid binnen het bedrijf dat centraal over privacy & security gaat.",
        "2": "Onvoldoende kennis binnen het gehele team over relevante privacythema's",
        "3": "Geen interne medewerker die specificeerd in privacy engineering."
      },
      "kansen": {
        "title": "Kansen",
        "1": "Post-quantum cryptografie",
        "2": "Privacy by design",
        "3": "Gebruik van externe tools"
      },
      "bedreigingen": {
        "title": "Bedreigingen",
        "1": "Notive krijgt een slechte naam als de regels niet worden gevolgd",
        "2": "Strenge regelgeving van de AVG",
        "3": "Datalekken (en aansprakelijkheid daarbij)."
      }
    },
    "confrontatiematrix": {
      "title": "Confrontatiematrix",
      "total": "Totaal:",
      "description": "De confrontatiematrix brengt de interne sterktes en zwaktes van Notive in kaart tegenover externe kansen en bedreigingen. Het is een subjectieve manier om zelf te bepalen wat relevant is op basis van hoe ik denk dat deze factoren tegenover elkaar staan. Op basis van de hoogste en laagste scores wordt bepaald welke onderwerpen relevant zijn voor het onderzoek en dus mogelijk een kunnen leiden tot een oplossing. Een extreem hoge score betekent dat dit onderwerp relevant is voor het onderzoek en zou kunnen dienen als ondersteuning. De extreem hoge en lage scores zijn het meest relevant voor het onderzoek. Deze onderwerpen kunnen namelijk worden ingezet als hulpmiddel, of juist hele grote obstakels vormen.",
      "sterktes": {
        "title": "Sterktes",
        "1": "Diverse kennisvlakken",
        "2": "Klantgericht",
        "3": "Positief imago"
      },
      "zwaktes": {
        "title": "Zwaktes",
        "1": "Geen duidelijk privacybeleid",
        "2": "Onvoldoende kennis binnen over relevante privacythema's",
        "3": "Geen interne specialist"
      },
      "kansen": {
        "title": "Kansen",
        "1": "Post-quantum cryptografie",
        "2": "Privacy by design",
        "3": "Gebruik van externe tools"
      },
      "bedreigingen": {
        "title": "Bedreigingen",
        "1": "Slechte naam als de regels niet worden gevolgd",
        "2": "Strenge regelgeving van de AVG",
        "3": "Datalekken (en aansprakelijkheid daarbij)."
      }
    },
    "impactladder": {
      "title": "Impactladder",
      "description": "De impactladder geeft inzicht in de stappen die Notive kan nemen om het uiteindelijke doel te bereiken (de impact). Het begint bij het probleem, gevolgd door het verbreden van de kennis, daarna de implementatie van tools en beleidsmaatregelen, actief gebruik van privacyprincipes, en eindigt met volledige AVG-conformiteit. Elke stap is een oorzaak die leidt tot het gevolg dat beschreven staat in de stap erboven.",
      "steps": {
        "1": {
          "title": "Impact",
          "card1": "Consistent conform de avg regelgeving werken."
        },
        "2": {
          "title": "Actief gebruik",
          "card1": "Privacy by design principe wordt geintegreerd in de werkwijze",
          "card2": "Gebruik gaan maken van tools en methodes zoals data discovery tools, DPIA tools, consent management tools, encryption tools, etc."
        },
        "3": {
          "title": "Implementatie",
          "card1": "Duidelijk privacybeleid opstellen (verantwoordelijkheid van SecOps & Management).",
          "card2": "Maandelijks presentaties geven over privacy- en security onderwerpen."
        },
        "4": {
          "title": "Kennis verbreden",
          "card1": "Kennis verbreden over verschillende tools en methodes."
        },
        "5": {
          "title": "Probleem",
          "card1": "Nog geen duidelijk privacy- en securitybeleid.",
          "card2": "Onvoldoende kennis over privacythema's en AVG regelgeving."
        }
      }
    },
    "onderbouwing": {
      "title": "Onderbouwing",
      "description": "In deze sectie onderbouw ik het standpunt dat ik aan het begin had vastgesteld in de sectie 'Probleem & Context'. Er wordt ingegaan op het privacybeleid, het privacy by design principe, en het vergroten van kennis binnen het team.",

      "privacyBeleid": {
        "title": "Privacybeleid",
        "1": {
          "title": "AVG regelgeving is streng",
          "text": "De AVG stelt hoge eisen. Als je als bedrijf deze regelgeving niet goed naleeft kan het leiden tot forse boetes en schade aan de reputatie van het bedrijf & de partners. (bron 3, 5, 6)"
        },
        "2": {
          "title": "Maakt het duidelijk wat de beleidsmaatregelen zijn",
          "text": "Een helder beleid maakt voor iedereen binnen het bedrijf duidelijk welke stappen en procedures gevolgd moeten worden. Daarnaast zou een duidelijk privacybeleid tegenover de partners & klanten de kans bieden om te begrijpen wat Notive voor hen doet op dit gebied. (bron 8)",
          "1": {
            "title": "Blijf transparant",
            "text": "Transparantie richting het team, maar ook naar de partners en klanten versterkt het vertrouwen en helpt juridische risico’s te minimaliseren."
          },
          "2": {
            "title": "Maakt het duidelijk welke tools en methodes we gebruiken",
            "text": "Door te documenteren welke tools en methodes we inzetten weet iedereen hoe gegevens veilig en conform de AVG verwerkt moeten worden. Zo wordt er ook gezorgd voor consistentie in het gebruik van de verschillende tools."
          }
        }
      },
      "pbd": {
        "title": "Privacy by design",
        "1": {
          "title": "Vroeg integreren",
          "text": "Door het privacy by design principe vanaf het begin van het proces te integreren zorg je ervoor dat AVG-compliance niet als bijzaak wordt gezien, maar een geïntegreerd onderdeel van de workflow. (bron 10)",
          "1": {
            "title": "Problemen voorkomen",
            "text": "Zoals al eerder vermeld was, is de AVG regelgeving een strenge wettelijke verplichting. Het toepassen van privacy by design helpt om te voldoen aan wettelijke verplichtingen."
          }
        },
        "2": {
          "title": "Moeite met toepassen (tegenargument)",
          "text": "Het kan een uitdaging zijn voor developers om privacy by design goed toe te passen, omdat dit planning en extra kennis vereist (bron 10).  Maar gelukkig is hier een oplossing voor. Er bestaan verschillende tools en methodes om hierbij te helpen. Deze tools en methodes worden hieronder verder uitgelegd."
        },
        "3": {
          "title": "Externe tools en methodes inzetten",
          "text": "Speciale tools helpen om privacy by design praktisch toe te passen en te monitoren, waardoor het makkelijker wordt om te voldoen aan de AVG regelgeving. Daarnaast zijn er ook methodes om bijvoorbeeld te zorgen dat de codestructuur van een project op een bepaalde wijze is ingedeeld die het makkelijker maakt om conform de AVG te werken.",
          "1": {
            "title": "Tools specifiek voor privacy by design",
            "text": "Er zijn verschillende tools en methodes ontworpen specifiek om privacy by design makkelijker te hanteren.",
            "1": {
              "title": "Verwerking in het privacybeleid",
              "text": "Door vast te leggen welke privacy tools en methodes worden gebruikt, ontstaat er duidelijkheid en consistentie binnen de organisatie. Dit zorgt ervoor dat medewerkers weten welke stappen zij moeten volgen bij het verwerken van persoonsgegevens en voorkomt dat privacymaatregelen willekeurig of onvolledig worden toegepast."
            },
            "2": {
              "title": "We maken al gebruik van een aantal tools",
              "text": "Omdat Notive al gebruikmaakt van verschillende tools, is er al een goede basis om op voort te bouwen. Zo kan er een sterke infrastructuur worden gemaakt binnen Notive."
            }
          },
          "2": {
            "title": "Voorbeelden van tools",
            "text": "Een aantal tools zijn onder andere data discovery tools, DPIA tools, consent management tools, encryption tools, etc. (bron 4). Deze tools kunnen worden ingezet om allerlei verschillende analyses uit te voeren binnen verschillende systemen en processen. Zo kun je bijvoorbeeld data-flows vastleggen, gemakkelijk cookies managen, data versleutelen, etc. (bron 7)"
          },
          "3": {
            "title": "Voorbeelden van methodes",
            "text": "De verschillende methodes die ik had gevonden waren een aantal modellen die gebaseerd zijn op de microservices architectuur. Dat zijn de volgende: Gatekeeper model, Service model, Federation model, Mesh model, Enclave model, Sidecar model, Endpoint model. Deze verschillende modellen kunnen worden toegepast als design pattern bij het bouwen van een microservice die gevoelige data verwerkt. (bron 1)"
          }
        }
      },
      "kennis": {
        "title": "Kennis",
        "1": {
          "title": "Er is binnen het gehele team kennis, maar het kan beter",
          "text": "Binnen het team van Notive is voldoende kennis over privacy en beveiliging, aangezien er een groot team aan developers rondloopt. Maar dit kan verbeterd worden. Wellicht kan het bijvoorbeeld handig zijn als het gehele team (inclusief office management & marketing team) kennis heeft over privacy & security. Zo kunnen zij ook meedenken.",
          "1": {
            "title": "Kennis kan worden verbreed door middel van presentaties.",
            "text": "Deze presentaties kunnen periodiek (bijvoorbeeld maandelijks) worden gegeven om interessante informatie en nieuwe trends toelichten. Dit kan wellicht worden gedaan door de SecOps engineer (nieuwe rol die binnenkort wordt toegevoegd), of door de solutions architect."
          }
        },
        "2": {
          "title": "Extra kennis helpt Notive om te groeien",
          "text": "Ook helpt de extra kennis voor de groei van het bedrijf. Als het marketing team meer kennis heeft kunnen zij bijvoorbeeld beter aan de klanten uitleggen hoe Notive bepaalde securityfeatures implementeren in het geval dat klanten daar vragen vragen hebben. Daarnaast biedt het ook een kans om te laten zien dat Notive er alles aan doet om te zorgen dat de AVG regelgeving wordt gevolgd en dat er verantwoordelijk met gevoelige gegevens wordt omgegaan."
        }
      }
    },
    "conclusie": {
      "title": "Conclusie",
      "recommendation": {
        "title": "Aanbevelingen",
        "1": "Stel een duidelijk privacy- en securitybeleid vast",
        "2": "Documenteer het gebruik van (externe) tools",
        "3": "Integreer ‘Privacy by Design’ structureel in processen",
        "4": "Ondersteun beleid met geschikte tools en maatregelen"
      },
      "summary": {
        "title": "Samenvatting",
        "text1": "Uit de analyse is gebleken dat het beleid rondom privacy en security op dit moment nog onvoldoende is vastgesteld binnen Notive. Terwijl er grote negatieve gevolgen kunnen zijn als er niet wordt voldaan aan de AVG regelgeving. Door middel van een SWOT-analyse, confrontatiematrix en een impactladder heb ik inzicht gekregen in de verschillende relevante factoren die komen kijken bij dit onderwerp.",
        "text2": "Uit de resultaten blijkt dat Notive zich moet focussen op het vaststellen van een duidelijk privacy- en securitybeleid. Dit beleid moet dienen als één centrale plek waar alle informatie staat over de verschillende (externe) tools waar Notive gebruik van maakt voor taken die te maken hebben met privacy- en security. Door privacy by design structureel te integreren, ondersteund door de tools en beleidsmaatregelen, kan Notive consistent aan projecten werken conform de AVG regelgeving en het vertrouwen van klanten en partners versterken."
      }
    },
    "bronnenlijst": {
      "title": "Bronnenlijst",
      "1": "Antunes, P., & Guimarães, N. (2024). Guiding the implementation of data privacy with microservices. International Journal of Information Security, 23, 3591–3608. https://doi.org/10.1007/s10207-024-00907-y",
      "2": "Assessing Software Privacy Using the Privacy Flow-Graph. (2022). ACM Digital Library. https://dl.acm.org/doi/10.1145/3549035.3561185",
      "3": "AVG Support. (z.d.). GDPR: Aan welke regels moet je voldoen? https://www.avg-support.nl/nieuws/gdpr-aan-welke-regels-moet-je-voldoen/",
      "4": "Cavoukian, A. (2022). Privacy by Design: In law, policy and practice [White paper]. Global Privacy & Security by Design Centre. https://gpsbydesigncentre.com/wp-content/uploads/2022/02/312239.pdf",
      "5": "Digitale Opsporing. (z.d.). Hoeveel een datalek je kost. https://www.digitaleopsporing.nl/hoeveel-een-datalek-je-kost/",
      "6": "Esri Nederland. (z.d.). Werken conform de AVG: sta jij daar bij stil? https://www.esri.nl/nl-nl/newsroom/blog/werken-conform-de-avg-sta-jij-daar-bij-stil",
      "7": "Exabeam. (2025, 6 november). 8 Types of GDPR Tools and How to Choose. https://www.exabeam.com/explainers/gdpr-compliance/8-types-of-gdpr-tools-and-how-to-choose/",
      "8": "Janssen, D. (2024, 16 juli). Big data en privacy. VPNGids. https://www.vpngids.nl/privacy/anoniem-browsen/big-data-en-privacy/",
      "9": "Kamer van Koophandel (KvK). (2025, 3 juni). Privacywetgeving AVG: Wanneer ben je compliant? https://www.kvk.nl/wetten-en-regels/privacywetgeving-avg-wanneer-ben-je-compliant/",
      "10": "Martín, Y.-S., & Kung, A. (2018). Methods and tools for GDPR compliance through privacy and data protection engineering. In Proceedings of the 2018 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW), 108–111. https://doi.org/10.1109/EuroSPW.2018.00021",
      "11": "Orange Cyber Defense. (2025, 11 augustus). Het post-quantum tijdperk: de uitdagingen en strategieën voor cybersecurity. https://www.orangecyberdefense.com/nl/blog/cybersecurity/het-post-quantum-tijdperk-de-uitdagingen-en-strategieen-voor-cybersecurity",
      "12": "Usercentrics. (z.d.). Data privacy audit: Are you data compliant? https://usercentrics.com/data-privacy-audit-are-you-data-compliant-nl/"
    }
  }
}

